app/controllers/api/greetings_controller.rb

  def index
    @greeting = Greeting.all.sample
---
SELECT "greetings".* FROM "greetings"